[



    {
    "imageUrl": "https://i.ibb.co/mVQ9mhfx/56bad5051b60e6e241d7d67c191f75db.webp",
    "title": "Prudential Solutions (Pvt.) Ltd",
    "description": "Prudential Solutions is offering on-site and remote internships for final-year students and recent grads in tech, design, content, and business. Apply by August 5, 2025, by sending your resume.Top performers may land long-term roles. To apply click on the card make sure to send your updated CV.",
    "color": "#006B3C",
    "url": "mailto:hr@prudsol.com"
  },

    {
    "imageUrl": "https://ik.imagekit.io/8dwwgulux/main%20upload/WhatsApp%20Image%202025-07-30%20at%2011.52.04_c489efcd.jpg?updatedAt=1753858504846",
    "title": "Funsol Technologies",
    "description": "Funsol is hiring 15 to 20 marketing interns for an exciting opportunity. You'll gain hands-on experience in app marketing, keyword research, and optimization. To apply, click on the card and send your update CV.",
    "color": "#006B3C",
    "url": "mailto:hr@funsoltech.com"
  },


 

    {
    "imageUrl": "https://ik.imagekit.io/8dwwgulux/main%20upload/1753253356350.jpeg?updatedAt=1753284711663",
    "title": "Orange Line Metro Internship Program",
    "description": "Orange Line Metro Rail is offering an Internship Program 2025 for fresh graduates and final-year students to gain real-world experience. Deadline: 3 August 2025. To apply click on the card.",
    "color": "#1C1B3A",
    "url": "https://docs.google.com/forms/d/e/1FAIpQLSe3yJl_AY4T-S0AUBIvHODkbOd0py4axAp9ykSwxxdpou5W8Q/viewform"
  },


    
{
    "imageUrl": "https://i.ibb.co/mVQ9mhfx/56bad5051b60e6e241d7d67c191f75db.webp",
    "title": "Metis International",
    "description":"Metis International is offering exciting internship opportunities for motivated individuals in Angular, Full Stack, SQA, Flutter, Backend, and Marketing. It's a great chance to grow your skills and start your career in a dynamic tech environment. To send your resume click on the card and mention the position in the subject line.",
    "color": "#0D1117",
    "url": "mailto:careers@metispvt.com"
  },


{
    "imageUrl": "https://i.ibb.co/mVQ9mhfx/56bad5051b60e6e241d7d67c191f75db.webp",
    "title": "Marcom Private Limited",
    "description":"MarCom (Pvt) Ltd is offering 2-month internships in Islamabad for final semester students or recent grads. Roles include marketing, media, content writing, digital marketing, and design. Gain hands-on experience, work with top clients, and earn a certificate. To apply through their portal click on the card ",
    "color": "#2C2C2C",
    "url": "https://www.brightspyre.com"
  },


   {
    "imageUrl": "https://ik.imagekit.io/8dwwgulux/main%20upload/1753083050700.jpeg?updatedAt=1753094496661",
    "title": "CoftTech Summer Internship Program",
    "description": "CoftTech offers remote or hybrid roles for students and recent grads in AI, development, automation, and BI. Gain hands-on experience on real projects.The program is remote or hybrid (Islamabad HQ). To send your CV with subject Summer Internship 2025–Your Desired Role, click on the card",
    "color": "#1A1A2E",
    "url": "mailto:info@cofttech.com"
  },
             
      

          


 ]

